# Parameter Type Id Rebar Type At End Property

Source: https://www.revitapidocs.com/2026/55f1f9d5-db6b-abd3-ec40-737bf90b4ccc.htm

---

| Parameter Type Id Rebar Type At End Property |
| --- |

"End of Bar"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId RebarTypeAtEnd { get; }
```

```
Public Shared ReadOnly Property RebarTypeAtEnd As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ RebarTypeAtEnd {
	ForgeTypeId^ get ();
}
```

```
static member RebarTypeAtEnd : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace